fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32h7_sd.cpp
/***************************************************************************
 *   Copyright (C) 2010-2014, 2026 by Terraneo Federico, Pigato Lorenzo,   *
 *                 Radu Raul                                               *
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 *   This program is distributed in the hope that it will be useful,       *
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of        *
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the         *
 *   GNU General Public License for more details.                          *
 *                                                                         *
 *   As a special exception, if other files instantiate templates or use   *
 *   macros or inline functions from this file, or you compile this file   *
 *   and link it with other works to produce a work based on this file,    *
 *   this file does not by itself cause the resulting work to be covered   *
 *   by the GNU General Public License. However the source code for this   *
 *   file must still be made available in accordance with the GNU General  *
 *   Public License. This exception does not invalidate any other reasons  *
 *   why a work based on this file might be covered by the GNU General     *
 *   Public License.                                                       *
 *                                                                         *
 *   You should have received a copy of the GNU General Public License     *
 *   along with this program; if not, see <http://www.gnu.org/licenses/>   *
 ***************************************************************************/

#include "stm32h7_sd.h"
#include "interfaces/bsp.h"
#include "interfaces/arch_registers.h"
#include "interfaces/interrupts.h"
#include "interfaces/cache.h"
#include "interfaces/delays.h"
#include "kernel/thread.h"
#include "board_settings.h" //For sdVoltage and SD_ONE_BIT_DATABUS definitions
#include <cstdio>
#include <cstring>
#include <errno.h>

//Note: enabling debugging might cause deadlock when using sleep() or reboot()
//The bug won't be fixed because debugging is only useful for driver development
///\internal Debug macro, for normal conditions
//#define DBG iprintf
#define DBG(x,...) do {} while(0)
///\internal Debug macro, for errors only
//#define DBGERR iprintf
#define DBGERR(x,...) do {} while(0)

#if SD_SDMMC==1
#define SDMMC                 SDMMC1
#define RCC_APB2ENR_SDMMCEN   RCC_APB2ENR_SDMMC1EN
#define SDMMC_IRQn            SDMMC1_IRQn
#elif SD_SDMMC==2
#define SDMMC                 SDMMC2
#define RCC_APB2ENR_SDMMCEN   RCC_APB2ENR_SDMMC2EN
#define SDMMC_IRQn            SDMMC2_IRQn
#else
#error SD_SDMMC undefined or not in range
#endif


constexpr int ICR_FLAGS_CLR=0x5ff;

namespace miosix {

static volatile bool transferError; ///< \internal DMA or SDMMC transfer error
static Thread *waiting;             ///< \internal Thread waiting for transfer
static unsigned int sdmmcFlags;     ///< \internal SDMMC status flags

/**
 * \internal
 * SDMMC interrupt handler
 */
void SDirqImpl()
{
    sdmmcFlags=SDMMC->STA;
    if(sdmmcFlags & (SDMMC_STA_RXOVERR  |
                    SDMMC_STA_TXUNDERR | SDMMC_STA_DTIMEOUT | SDMMC_STA_DCRCFAIL))
        transferError=true;

    SDMMC->ICR=ICR_FLAGS_CLR; //Clear flags

    if(!waiting) return;
    waiting->IRQwakeup();
    waiting=nullptr;
}

/*
 * Operating voltage of device. It is sent to the SD card to check if it can
 * work at this voltage. Range *must* be within 28..36
 * Example 33=3.3v
 */
//static const unsigned char sdVoltage=33; //Is defined in board_settings.h
static const unsigned int sdVoltageMask=1<<(sdVoltage-13); //See OCR reg in SD spec

/**
 * \internal
 * Possible state of the cardType variable.
 */
enum CardType
{
    Invalid=0, ///<\internal Invalid card type
    MMC=1<<0,  ///<\internal if(cardType==MMC) card is an MMC
    SDv1=1<<1, ///<\internal if(cardType==SDv1) card is an SDv1
    SDv2=1<<2, ///<\internal if(cardType==SDv2) card is an SDv2
    SDHC=1<<3  ///<\internal if(cardType==SDHC) card is an SDHC
};

///\internal Type of card.
static CardType cardType=Invalid;

//SD card GPIOs
#if SD_SDMMC==2
typedef Gpio<PG,9>  sdD0;
typedef Gpio<PG,10> sdD1;
typedef Gpio<PB,3>  sdD2;
typedef Gpio<PB,4>  sdD3;
typedef Gpio<PD,6>  sdCLK;
typedef Gpio<PD,7>  sdCMD;
#else
typedef Gpio<PC,8>  sdD0;
typedef Gpio<PC,9>  sdD1;
typedef Gpio<PC,10> sdD2;
typedef Gpio<PC,11> sdD3;
typedef Gpio<PC,12> sdCLK;
typedef Gpio<PD,2>  sdCMD;
#endif

// 
// enum CommandType
// 

/**
 * \internal
 * SD/MMC commands
 * - bit #7 is @ 1 if a command is an ACMDxx. send() will send the
 *   sequence CMD55, CMDxx
 * - bit from #0 to #5 indicate command index (CMD0..CMD63)
 * - bit #6 is don't care
 */
enum class CommandType
{
    CMD0=0,           //GO_IDLE_STATE
    CMD2=2,           //ALL_SEND_CID
    CMD3=3,           //SEND_RELATIVE_ADDR
    ACMD6=0x80 | 6,   //SET_BUS_WIDTH
    CMD7=7,           //SELECT_DESELECT_CARD
    ACMD41=0x80 | 41, //SEND_OP_COND (SD)
    CMD8=8,           //SEND_IF_COND
    CMD9=9,           //SEND_CSD
    CMD12=12,         //STOP_TRANSMISSION
    CMD13=13,         //SEND_STATUS
    CMD16=16,         //SET_BLOCKLEN
    CMD17=17,         //READ_SINGLE_BLOCK
    CMD18=18,         //READ_MULTIPLE_BLOCK
    ACMD23=0x80 | 23, //SET_WR_BLK_ERASE_COUNT (SD)
    CMD24=24,         //WRITE_BLOCK
    CMD25=25,         //WRITE_MULTIPLE_BLOCK
    CMD55=55          //APP_CMD
};

//
// Class CmdResult
//

/**
 * \internal
 * Contains the result of an SD/MMC command
 */
class CmdResult
{
public:

    /**
     * \internal
     * Possible outcomes of sending a command
     */
    enum Error
    {
        Ok=0,        /// No errors
        Timeout,     /// Timeout while waiting command reply
        CRCFail,     /// CRC check failed in command reply
        RespNotMatch,/// Response index does not match command index
        ACMDFail     /// Sending CMD55 failed
    };

    /**
     * \internal
     * Default constructor
     */
    CmdResult(): cmd(CommandType::CMD0), error(Ok), response{0,0,0,0} {}

    /**
     * \internal
     * Constructor,  set the response data
     * \param cmd command index of command that was sent
     * \param result result of command
     */
    CmdResult(CommandType cmd, Error error): cmd(cmd), error(error) 
    {
        if(cmd==CommandType::CMD9) 
        {
            response[0]=SDMMC->RESP4;
            response[1]=SDMMC->RESP3;
            response[2]=SDMMC->RESP2;
            response[3]=SDMMC->RESP1;
        } else {
            response[0]=SDMMC->RESP1;           
        }
    }

    /**
     * \internal
     * \return the 32 bit of the response.
     * May not be valid if getError()!=Ok or the command does not send a
     * response, such as CMD0
     */
    unsigned int getShortResponse() { return response[0]; }

    /**
     * \internal
     * \param part one of the four 32 bit parts of the 128 bit response
     * \return the part selected with the part parameter or 0 if out of bounds
     */
    unsigned int getLongResponsePart(size_t part)
    {
        if(part>=4) return 0;
        return response[part];
    }

    /**
     * \internal
     * \return the error flags of the response
     */
    Error getError() { return error; }

    /**
     * \internal
     * Checks if errors occurred while sending the command.
     * \return true if no errors, false otherwise
     */
    bool validateError();

    /**
     * \internal
     * interprets this->getShortResponse() as an R1 response, and checks if there are
     * errors, or everything is ok
     * \return true on success, false on failure
     */
    bool validateR1Response();

    /**
     * \internal
     * Same as validateR1Response, but can be called with interrupts disabled.
     * \return true on success, false on failure
     */
    bool IRQvalidateR1Response();

    /**
     * \internal checks if there was an error during long response exchange.
     * R2 responses can never generate RespNotMatch error.
     * \return true on success, false on any error
     */
    bool validateR2Response();

    /**
     * \internal
     * interprets this->getShortResponse() as an R6 response, and checks if 
     * there are errors, or everything is ok.
     * \return true on success, false on failure
     */
    bool validateR6Response();

    /**
     * \internal
     * \return the card state from an R1 or R6 response
     */
    unsigned char getState();

