fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32h7_sd.cpp
private:
    /**
     * Set SDMMC clock speed
     * \param clkdiv speed is clkdiv==0 ? SDMMCCLK : SDMMCCLK/(2*clkdiv)
     */
    static void setClockSpeed(unsigned int clkdiv);
    
    static_assert(cpuFrequency==550000000 || cpuFrequency==400000000,
        "Unknown frequency for PLL Q output");
    static const unsigned int SDMMCCLK=
        cpuFrequency==550000000 ? 91666666 : 100000000;

    static const unsigned int CLOCK_400KHz=SDMMCCLK/(2*400000);
    static_assert(CLOCK_400KHz>0,"");
    #ifdef OVERRIDE_SD_CLOCK_DIVIDER_MAX
    //Some boards using SDRAM cause SDMMC TX Underrun occasionally
    static const unsigned int CLOCK_MAX=OVERRIDE_SD_CLOCK_DIVIDER_MAX;
    #else //OVERRIDE_SD_CLOCK_DIVIDER_MAX
    static const unsigned int CLOCK_MAX=1; ////Should be <=50MHz
    #endif //OVERRIDE_SD_CLOCK_DIVIDER_MAX

    #ifdef SD_ONE_BIT_DATABUS
    ///\internal Clock enabled, bus width 1bit, clock powersave enabled.
    static const unsigned int CLKCR_FLAGS=SDMMC_CLKCR_PWRSAV;
    #else //SD_ONE_BIT_DATABUS
    ///\internal Clock enabled, bus width 4bit, clock powersave enabled.
    static const unsigned int CLKCR_FLAGS=SDMMC_CLKCR_WIDBUS_0 | SDMMC_CLKCR_PWRSAV;
    #endif //SD_ONE_BIT_DATABUS

    ///\internal Maximum number of calls to IRQreduceClockSpeed() allowed
    static const unsigned char MAX_ALLOWED_REDUCTIONS=1;

    ///\internal value returned by getRetryCount() while *not* calibrating clock.
    static const unsigned char MAX_RETRY=10;

    ///\internal Used to allow only one call to reduceClockSpeed()
    static unsigned char clockReductionAvailable;

    ///\internal value returned by getRetryCount()
    static unsigned char retries;
};

bool ClockController::calibrateClockSpeed(SDIODriver *sdmmc)
{
    // During calibration we call readBlock(), which can request clock
    // reduction after transfer errors. Keep it disabled while searching or the
    // calibration result would become self-invalidating.
    clockReductionAvailable=0;

    DBG("Automatic speed calibration\n");
    unsigned int reference[512/sizeof(unsigned int)];
    unsigned int probe[512/sizeof(unsigned int)];   
    unsigned int minFreq=CLOCK_400KHz;
    unsigned int maxFreq=CLOCK_MAX;
    unsigned int selected;
    bool success=false;
    const unsigned char calibrationProbeReads=2;

    // First capture a known-good reference block at 400kHz. Some unstable
    // speeds can complete a transfer without protocol errors while still
    // returning corrupted payload, so calibration must validate data too.
    // This low-speed reference read may use normal retries because it is
    // not testing the upper bus-speed limit.
    setClockSpeed(minFreq);
    retries=MAX_RETRY;
    if(sdmmc->readBlock(reinterpret_cast<unsigned char*>(reference),512,0)!=512)
    {
        clockReductionAvailable=MAX_ALLOWED_REDUCTIONS;
        return false;
    }

    // Candidate reads must be single-shot and repeated explicitly: accepting a
    // speed because one retry succeeded would select a marginal clock, while a
    // single successful read would not prove that the selected clock is stable.
    retries=1;
    auto clockCandidateIsStable=[&]() {
        for(unsigned int i=0;i<calibrationProbeReads;i++)
        {
            if(sdmmc->readBlock(reinterpret_cast<unsigned char*>(probe),512,0)!=512
            || std::memcmp(probe, reference, sizeof(reference))!=0)
                return false;
        }
        return true;
    };

    while(minFreq-maxFreq>1)
    {
        selected=(minFreq+maxFreq)/2;
        DBG("Trying CLKCR=%d\n",selected);
        setClockSpeed(selected);
        if(clockCandidateIsStable()) minFreq=selected;
        else maxFreq=selected;
    }

    //Last round of algorithm
    setClockSpeed(maxFreq+1);
    success=clockCandidateIsStable();
    if(success)
    {
        DBG("Optimal CLKCR=%d\n",maxFreq+1);
    } else {
        setClockSpeed(minFreq);
        success=clockCandidateIsStable();
        if(success) DBG("Optimal CLKCR=%d\n",minFreq);
        else DBGERR("Automatic speed calibration failed\n");
    }

    clockReductionAvailable=MAX_ALLOWED_REDUCTIONS;
    retries=MAX_RETRY;
    return success;
}

bool ClockController::reduceClockSpeed()
{
    DBGERR("clock speed reduction requested\n");
    //Ensure this function can be called only a few times
    if(clockReductionAvailable==0) return false;
    clockReductionAvailable--;

    unsigned int currentClkcr=SDMMC->CLKCR & 0x3ff;
    if(currentClkcr==CLOCK_400KHz) return false; //No lower than this value

    //If the value of clockcr is low, increasing it by one is enough since
    //frequency changes a lot, otherwise increase by 2.
    if(currentClkcr<10) currentClkcr++;
    else currentClkcr+=2;

    DBG("New clock speed %d\n", currentClkcr);
    setClockSpeed(currentClkcr);
    return true;
}

void ClockController::setClockSpeed(unsigned int clkdiv)
{
    #ifndef SD_KEEP_CARD_SELECTED
    SDMMC->CLKCR=clkdiv | CLKCR_FLAGS;
    #else //SD_KEEP_CARD_SELECTED
    SDMMC->CLKCR=clkdiv | CLKCR_FLAGS | SDMMC_CLKCR_HWFC_EN;
    #endif //SD_KEEP_CARD_SELECTED
    //Timeout 600ms expressed in SD_CK cycles
    if(clkdiv==0) SDMMC->DTIMER=6*SDMMCCLK/10; //No clock division if clockdiv=0
    else SDMMC->DTIMER=6*SDMMCCLK/(10*2*clkdiv);
}

unsigned char ClockController::clockReductionAvailable=0;
unsigned char ClockController::retries=ClockController::MAX_RETRY;

//
// Data send/receive functions
//

/**
 * \internal
 * Wait until the card is ready for data transfer.
 * Can be called independently of the card being selected.
 * \return true on success, false on failure
 */
static bool waitForCardReady()
{
    //The card may remain busy for up to 500ms and there appears to be no way
    //to set an interrupt to wait until it becomes ready again. We can't just
    //poll for that long as if a high priority thread is stuck polling all lower
    //priority threads block, so we are forced to do a sleep. The initial value
    //of 2ms was found to be impacting performance excessively, so we take
    //advantage of high resolution timers by sleeping for 200us, and fallback to
    //the previous value only for slow configurations
    #if !defined(__CODE_IN_XRAM)
    const long long sleepTime=200000;
    #else
    const long long sleepTime=2000000;
    #endif
    long long timeout=getTime()+1500000000; //Timeout 1.5 second
    do {
        CmdResult cr=Command::send(CommandType::CMD13,Command::getRca()<<16);
        if(cr.validateR1Response()==false) return false;
        //Bit 8 in R1 response means ready for data.
        if(cr.getShortResponse() & (1<<8)) return true;
        Thread::nanoSleep(sleepTime);
    } while(getTime()<timeout);
    DBGERR("Timeout waiting card ready\n");
    return false;
}

/**
 * \internal
 * Prints the errors that may occur during a DMA transfer
 */
static void displayBlockTransferError()
{
    DBGERR("Block transfer error\n");
    // if(sdmmcFlags & SDMMC_STA_STBITERR) DBGERR("* SDMMC Start bit error\n");
    if(sdmmcFlags & SDMMC_STA_RXOVERR)  DBGERR("* SDMMC RX Overrun\n");
    if(sdmmcFlags & SDMMC_STA_TXUNDERR) DBGERR("* SDMMC TX Underrun error\n");
    if(sdmmcFlags & SDMMC_STA_DCRCFAIL) DBGERR("* SDMMC Data CRC fail\n");
    if(sdmmcFlags & SDMMC_STA_DTIMEOUT) DBGERR("* SDMMC Data timeout\n");
}

/**
 * \internal
 * Contains initial common code between multipleBlockRead and multipleBlockWrite
 * to clear interrupt and error flags, set the waiting thread 
 */
static void transferCommonSetup(const unsigned char *buffer)
{
    //Clear SDMMC interrupt flags
    SDMMC->ICR=ICR_FLAGS_CLR;
    transferError=false;
    sdmmcFlags=0;
    waiting=Thread::getCurrentThread();
}

/**
 * \internal
 * Read a given number of contiguous 512 byte blocks from an SD/MMC card.
 * Card must be selected prior to calling this function.
 * \param buffer, a buffer whose size is 512*nblk bytes
 * \param nblk number of blocks to read.
 * \param lba logical block address of the first block to read.
 */
static bool multipleBlockRead(unsigned char *buffer, unsigned int nblk,
    unsigned int lba)
{
    if(nblk==0) return true;
    // TODO check how many sectors can be read in the H7
    while(nblk>32767)
    {
        if(multipleBlockRead(buffer,32767,lba)==false) return false;
        buffer+=32767*512;
        nblk-=32767;
        lba+=32767;
    }
    if(waitForCardReady()==false) return false;
    
    if(cardType!=SDHC) lba*=512; // Convert to byte address if not SDHC
    
