fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32h7_sd.cpp
    transferCommonSetup(buffer);
    
    //Data transfer is considered complete once the DMA transfer complete
    //interrupt occurs, that happens when the last data was written in the
    //buffer. Both SDMMC and DMA error interrupts are active to catch errors
    SDMMC->MASK=SDMMC_MASK_RXOVERRIE  | //Interrupt on rx underrun
            //    SDMMC_MASK_IDMABTCIE | //Interrupt on IDMA transfer complete
               SDMMC_MASK_DATAENDIE | //Interrupt on IDMA data end
               SDMMC_MASK_TXUNDERRIE | //Interrupt on tx underrun
               SDMMC_MASK_DCRCFAILIE | //Interrupt on data CRC fail
               SDMMC_MASK_DTIMEOUTIE;  //Interrupt on data timeout
    
    SDMMC->CMD |= SDMMC_CMD_CMDTRANS;

    SDMMC->IDMABASE0 = reinterpret_cast<unsigned int>(buffer);
    SDMMC->IDMACTRL &= ~SDMMC_IDMA_IDMABMODE;
    SDMMC->IDMACTRL |= SDMMC_IDMA_IDMAEN;
    
    SDMMC->DLEN=nblk*512;

    if(waiting==0)
    {
        DBGERR("Premature wakeup\n");
        transferError=true;
    }
    CmdResult cr=Command::send(nblk>1 ? CommandType::CMD18 : CommandType::CMD17,lba);
    if(cr.validateR1Response())
    {
        //Block size 512 bytes, block data xfer, from card to controller
        SDMMC->DCTRL=(9<<4) | SDMMC_DCTRL_DTDIR | SDMMC_DCTRL_DTEN;
        FastGlobalIrqLock dLock;
        while(waiting) Thread::IRQglobalIrqUnlockAndWait(dLock);

        // This while has been benchmarked and it runs for less then 200 ns for
        // every read issued. It is needed to wait for the IDMA transfer complete 
        // after the wakeup to confirm that the data is consistent.
        while(SDMMC->STA & SDMMC_STA_IDMABTC) ;
        
    } else transferError=true;
  
    SDMMC->DCTRL=0; //Disable data path state machine
    SDMMC->MASK=0;

    // CMD12 is sent to end CMD18 (multiple block read), or to abort an
    // unfinished read in case of errors
    if(nblk>1 || transferError) 
    {
        cr=Command::send(CommandType::CMD12,0);
        if(transferError)
        {
            // CMD13 is sent to check the real status of the sdio after CMD12
            // and to reset the card in case if it gets stuck in a illegal state
            cr=Command::send(CommandType::CMD13,Command::getRca()<<16);
        }
    }
    if(transferError || cr.validateR1Response()==false)
    {
        displayBlockTransferError();
        ClockController::reduceClockSpeed();
        return false;
    }

    //Read ok, deal with cache coherence
    markBufferAfterDmaRead(buffer,nblk*512);

    return true;
}

/**
 * \internal
 * Write a given number of contiguous 512 byte blocks to an SD/MMC card.
 * Card must be selected prior to calling this function.
 * \param buffer, a buffer whose size is 512*nblk bytes
 * \param nblk number of blocks to write.
 * \param lba logical block address of the first block to write.
 */
static bool multipleBlockWrite(const unsigned char *buffer, unsigned int nblk,
    unsigned int lba)
{
    if(nblk==0) return true;
    while(nblk>32767)
    {
        if(multipleBlockWrite(buffer,32767,lba)==false) return false;
        buffer+=32767*512;
        nblk-=32767;
        lba+=32767;
    }
    
    //Deal with cache coherence
    markBufferBeforeDmaWrite(buffer,nblk*512);
    
    if(waitForCardReady()==false) return false;
    
    if(cardType!=SDHC) lba*=512; // Convert to byte address if not SDHC
    if(nblk>1)
    {
        CmdResult cr=Command::send(CommandType::ACMD23,nblk);
        if(cr.validateR1Response()==false) return false;
    }
    
    transferCommonSetup(buffer);
    
    //Data transfer is considered complete once the SDMMC transfer complete
    //interrupt occurs, that happens when the last data was written to the SDMMC
    //Both SDMMC and DMA error interrupts are active to catch errors
    SDMMC->MASK=SDMMC_MASK_DATAENDIE  | //Interrupt on data end
               SDMMC_MASK_IDMABTCIE | //Interrupt on IDMA transfer complete
            //    SDMMC_MASK_STBITERRIE | //Interrupt on start bit error
               SDMMC_MASK_RXOVERRIE  | //Interrupt on rx underrun
               SDMMC_MASK_TXUNDERRIE | //Interrupt on tx underrun
               SDMMC_MASK_DCRCFAILIE | //Interrupt on data CRC fail
               SDMMC_MASK_DTIMEOUTIE;  //Interrupt on data timeout

    SDMMC->IDMABASE0 = reinterpret_cast<unsigned int>(buffer);
    SDMMC->IDMACTRL = SDMMC_IDMA_IDMAEN;
    
    SDMMC->DLEN=nblk*512;
    if(waiting==0)
    {
        DBGERR("Premature wakeup\n");
        transferError=true;
    }
    CmdResult cr=Command::send(nblk>1 ? CommandType::CMD25 : CommandType::CMD24,lba);
    if(cr.validateR1Response())
    {
        //Block size 512 bytes, block data xfer, from card to controller
        SDMMC->DCTRL=(9<<4) | SDMMC_DCTRL_DTEN;
        FastGlobalIrqLock dLock;
        while(waiting) Thread::IRQglobalIrqUnlockAndWait(dLock);
    } else transferError=true;
    
    SDMMC->DCTRL=0; //Disable data path state machine
    SDMMC->MASK=0;

    // CMD12 is sent to end CMD25 (multiple block write), or to abort an
    // unfinished write in case of errors
    if(nblk>1 || transferError) 
    {
        cr=Command::send(CommandType::CMD12,0);
        if(transferError)
        {
            // CMD13 is sent to check the real status of the sdio after CMD12
            // and to reset the card in case if it gets stuck in a illegal state
            cr=Command::send(CommandType::CMD13,Command::getRca()<<16);
        }
    }
    if(transferError || cr.validateR1Response()==false)
    {
        displayBlockTransferError();
        ClockController::reduceClockSpeed();
        return false;
    }
    return true;
}

//
// Class CardSelector
//

#ifndef SD_KEEP_CARD_SELECTED
/**
 * \internal
 * Simple RAII class for selecting an SD/MMC card an automatically deselect it
 * at the end of the scope.
 */
class CardSelector
{
public:
    /**
     * \internal
     * Constructor. Selects the card.
     * The result of the select operation is available through its succeded()
     * member function
     */
    explicit CardSelector()
    {
        success=Command::send(
                CommandType::CMD7,Command::getRca()<<16).validateR1Response();
    }

    /**
     * \internal
     * \return true if the card was selected, false on error
     */
    bool succeded() { return success; }

    /**
     * \internal
     * Destructor, ensures that the card is deselected
     */
    ~CardSelector()
    {
        Command::send(CommandType::CMD7,0); //Deselect card. This will timeout
    }

