fedetft/miosix-kernel/miosix/arch/drivers/sdmmc/stm32h7_sd.cpp
private:
    bool success;
};
#endif //SD_KEEP_CARD_SELECTED

//
// Initialization helper functions
//

/**
 * \internal
 * One-time SDMMC setup: clocks, GPIO alternate functions and IRQ registration.
 */
static void initSDMMCPeripheralOnce() {
    //Doing read-modify-write on RCC->APBENR2 and gpios, better be safe
    GlobalIrqLock lock;
    RCC->AHB4ENR |= RCC_AHB4ENR_GPIOCEN
                    | RCC_AHB4ENR_GPIODEN
                    ;
    RCC_SYNC();
    #if SD_SDMMC==1
    RCC->AHB3ENR |= RCC_AHB3ENR_SDMMC1EN;
    #else
    RCC->AHB2ENR |= RCC_AHB2ENR_SDMMC2EN;
    #endif
    RCC_SYNC();
    #if SD_SDMMC==2
    sdD0::mode(Mode::ALTERNATE);
    sdD0::alternateFunction(11);
    #ifndef SD_ONE_BIT_DATABUS
    sdD1::mode(Mode::ALTERNATE);
    sdD1::alternateFunction(11);
    sdD2::mode(Mode::ALTERNATE);
    sdD2::alternateFunction(9);
    sdD3::mode(Mode::ALTERNATE);
    sdD3::alternateFunction(9);
    #endif // SD_ONE_BIT_DATABUS
    sdCLK::mode(Mode::ALTERNATE);
    sdCLK::alternateFunction(11);
    sdCMD::mode(Mode::ALTERNATE);
    sdCMD::alternateFunction(11);
    #else
    sdD0::mode(Mode::ALTERNATE);
    sdD0::alternateFunction(12);
    #ifndef SD_ONE_BIT_DATABUS
    sdD1::mode(Mode::ALTERNATE);
    sdD1::alternateFunction(12);
    sdD2::mode(Mode::ALTERNATE);
    sdD2::alternateFunction(12);
    sdD3::mode(Mode::ALTERNATE);
    sdD3::alternateFunction(12);
    #endif // SD_ONE_BIT_DATABUS
    sdCLK::mode(Mode::ALTERNATE);
    sdCLK::alternateFunction(12);
    sdCMD::mode(Mode::ALTERNATE);
    sdCMD::alternateFunction(12);
    #endif
    IRQregisterIrq(lock,SDMMC_IRQn,SDirqImpl);
}

/**
 * \internal
 * Reset and restart the SDMMC peripheral state machine
 */
static void initSDMMCPeripheral()
{
    SDMMC->POWER=0; //Power off state
    delayUs(1);
    SDMMC->CLKCR=0;
    SDMMC->CMD=0;
    SDMMC->DCTRL=0;
    SDMMC->ICR=0x4005ff;
    SDMMC->POWER=SDMMC_POWER_PWRCTRL_1 | SDMMC_POWER_PWRCTRL_0; //Power on state
    //This delay is particularly important: when setting the POWER register a
    //glitch on the CMD pin happens. This glitch has a fast fall time and a slow
    //rise time resembling an RC charge with a ~6us rise time. If the clock is
    //started too soon, the card sees a clock pulse while CMD is low, and
    //interprets it as a start bit. No, setting POWER to powerup does not
    //eliminate the glitch.
    delayUs(10);
    ClockController::setLowSpeedClock();
    //Wait at least 74 clock cycles before first command
    Thread::nanoSleep(250000);
}

/**
 * \internal
 * Detect if the card is an SDHC, SDv2, SDv1, MMC
 * \return Type of card: (1<<0)=MMC (1<<1)=SDv1 (1<<2)=SDv2 (1<<2)|(1<<3)=SDHC
 * or Invalid if card detect failed.
 */
static CardType detectCardType()
{
    const int INIT_TIMEOUT=200; //200*10ms= 2 seconds
    CmdResult r=Command::send(CommandType::CMD8,0x1aa);
    if(r.validateError())
    {
        //We have an SDv2 card connected
        if(r.getShortResponse()!=0x1aa)
        {
            DBGERR("CMD8 validation: voltage range fail\n");
            return Invalid;
        }
        for(int i=0;i<INIT_TIMEOUT;i++)
        {
            //Bit 30 @ 1 = tell the card we like SDHCs
            r=Command::send(CommandType::ACMD41,(1<<30) | sdVoltageMask);
            //ACMD41 sends R3 as response, whose CRC is wrong.
            if(r.getError()!=CmdResult::Ok && r.getError()!=CmdResult::CRCFail)
            {
                r.validateError();
                return Invalid;
            }
            if((r.getShortResponse() & (1<<31))==0) //Busy bit
            {
                Thread::sleep(10);
                continue;
            }
            if((r.getShortResponse() & sdVoltageMask)==0)
            {
                DBGERR("ACMD41 validation: voltage range fail\n");
                return Invalid;
            }
            DBG("ACMD41 validation: looped %d times\n",i);
            if(r.getShortResponse() & (1<<30))
            {
                DBG("SDHC\n");
                return SDHC;
            } else {
                DBG("SDv2\n");
                return SDv2;
            }
        }
        DBGERR("ACMD41 validation: looped until timeout\n");
        return Invalid;
    } else {
        //We have an SDv1 or MMC
        r=Command::send(CommandType::ACMD41,sdVoltageMask);
        //ACMD41 sends R3 as response, whose CRC is wrong.
        if(r.getError()!=CmdResult::Ok && r.getError()!=CmdResult::CRCFail)
        {
            //MMC card
            DBG("MMC card\n");
            return MMC;
        } else {
            //SDv1 card
            for(int i=0;i<INIT_TIMEOUT;i++)
            {
                //ACMD41 sends R3 as response, whose CRC is wrong.
                if(r.getError()!=CmdResult::Ok &&
                        r.getError()!=CmdResult::CRCFail)
                {
                    r.validateError();
                    return Invalid;
                }
                if((r.getShortResponse() & (1<<31))==0) //Busy bit
                {
                    Thread::sleep(10);
                    //Send again command
                    r=Command::send(CommandType::ACMD41,sdVoltageMask);
                    continue;
                }
                if((r.getShortResponse() & sdVoltageMask)==0)
                {
                    DBGERR("ACMD41 validation: voltage range fail\n");
                    return Invalid;
                }
                DBG("ACMD41 validation: looped %d times\nSDv1\n",i);
                return SDv1;
            }
            DBGERR("ACMD41 validation: looped until timeout\n");
            return Invalid;
        }
    }
}

static off_t getCardSize() {

    CmdResult r=Command::send(CommandType::CMD9,Command::getRca()<<16);    //Get CSD 
    if(r.validateR2Response()==false) return 0;
    auto csdStructure = (r.getLongResponsePart(3) & 0xC0000000) >> 30;
    switch (csdStructure) {
        case 0: {
            DBG("CSD structure version 1.0\n");
            auto cSize  = ((r.getLongResponsePart(2) & 0x000003ff)) << 2 | ((r.getLongResponsePart(1) & 0xC0000000) >> 30);
            DBG("C_SIZE=%8X\n", cSize);
            auto cSizeMult = (r.getLongResponsePart(1) & 0x00038000) >> 15;
            DBG("C_SIZE_MULT=%8X\n", cSizeMult);
            auto readBlLen = (r.getLongResponsePart(2) & 0x000F0000) >> 16;
            DBG("READ_BL_LEN=%8X\n", readBlLen);
            return (cSize + 1) * (1 << (cSizeMult + 2)) * (1 << readBlLen); // (C_SIZE + 1) * 2^(C_SIZE_MULT + 2) * 2^READ_BL_LEN
        }
        case 1: {
            DBG("CSD structure version 2.0\n");
            off_t cSize = (r.getLongResponsePart(1) & 0xffff0000) >> 16 | ((r.getLongResponsePart(2) & 0x0000001f) << 16);
            DBG("C_SIZE=%16llX\n", cSize);
            return (cSize + 1) * (512 * 1024); // (C_SIZE + 1) * 512KB, since C_SIZE is in units of 512KB for CSD version 2.0
        }
        case 2: {
            DBG("CSD structure version 3.0\n");
            off_t cSize = (r.getLongResponsePart(1) & 0xffff0000) >> 16 | ((r.getLongResponsePart(2) & 0x000007ff) << 16);
            DBG("C_SIZE=%16llX\n", cSize);
            return (cSize + 1) * (512 * 1024); // Same formula as CSD version 2.0, but with a larger C_SIZE field
        }
        default:
            DBGERR("Unsupported CSD structure version: %d\n", csdStructure);
            return 0;
    }

